Wikitutorials/tutorials/lagrangian/reactingParcelFoam/splashPanel/0/wallFilm/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/wallFilm";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls_top
    {
        type            zeroGradient;
    }

    region0_to_wallFilm_walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
